EDT/ZUP/zup_edt/src/Documents/ЗаявкаНаПодборПерсонала/ЗаявкаНаПодборПерсонала.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаПодборПерсонала</name>
  <basedOn>Catalog.ПрофилиДолжностей</basedOn>
  <attributes>
    <name>Позиция</name>
    <type>
      <types>CatalogRef.ШтатноеРасписание</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрофильДолжности</name>
    <type>
      <types>CatalogRef.ПрофилиДолжностей</types>
    </type>
  </attributes>
  <attributes>
    <name>СоответствуетПрофилюДолжности</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Требования</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Обязанности</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Условия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредполагаемыйДоход</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланируемаяДатаЗакрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>EnumRef.Приоритет</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОткрытия</name>
    <type>
      <types>CatalogRef.ПричиныОткрытияВакансий</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСостояние</name>
    <type>
      <types>EnumRef.СостоянияСогласования</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьРассмотрел</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьДатаРассмотрения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособНабора</name>
    <type>
      <types>EnumRef.СпособНабораПерсоналаНаВакансию</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеНабора</name>
    <type>
      <types>EnumRef.НазначениеНабораПерсоналаНаВакансию</types>
    </type>
  </attributes>
  <attributes>
    <name>НоваяПозиция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ХарактеристикиПерсонала</name>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ХарактеристикиПерсонала</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ХарактеристикиПерсонала</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТребуетсяПроверка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТребуетсяОбучение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВесЗначения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДействияСотрудников</name>
    <attributes>
      <name>ДействиеСотрудника</name>
      <type>
        <types>CatalogRef.ДействияСотрудников</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/ZUP/zup_edt/src/Enums/НазначениеНабораПерсоналаНаВакансию/НазначениеНабораПерсоналаНаВакансию.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>НазначениеНабораПерсоналаНаВакансию</name>
  <enumValues>
    <name>ПозицияШтатногоРасписания</name>
  </enumValues>
  <enumValues>
    <name>ДолжностьПодразделение</name>
  </enumValues>
</mdclass:Enum>

EDT/ZUP/zup_edt/src/Catalogs/Вакансии/Вакансии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Вакансии</name>
  <basedOn>Document.ЗаявкаНаПодборПерсонала</basedOn>
  <basedOn>Catalog.ПрофилиДолжностей</basedOn>
  <attributes>
    <name>Позиция</name>
    <type>
      <types>CatalogRef.ШтатноеРасписание</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрофильДолжности</name>
    <type>
      <types>CatalogRef.ПрофилиДолжностей</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредполагаемыйДоход</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Заявитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОткрытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланируемаяДатаЗакрытия</name>
    <comment>АПК:58 Имя не меняется для сохранения совместимости, синоним меняется на более лаконичный</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСостояние</name>
    <type>
      <types>EnumRef.СостоянияВакансии</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьДатаСостояния</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаявкаНаПодборПерсонала</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <comment>АПК:58 Имя не меняется для сохранения совместимости, синоним меняется для единообразия с заявкой в форме «Согласование вакансий»</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СоответствуетПрофилюДолжности</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Требования</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Обязанности</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Условия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Сложность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>EnumRef.Приоритет</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОткрытия</name>
    <type>
      <types>CatalogRef.ПричиныОткрытияВакансий</types>
    </type>
  </attributes>
  <attributes>
    <name>УточнениеНаименования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособНабора</name>
    <type>
      <types>EnumRef.СпособНабораПерсоналаНаВакансию</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеНабора</name>
    <type>
      <types>EnumRef.НазначениеНабораПерсоналаНаВакансию</types>
    </type>
  </attributes>
  <attributes>
    <name>НоваяПозиция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ХарактеристикиПерсонала</name>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ХарактеристикиПерсонала</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ХарактеристикиПерсонала</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТребуетсяПроверка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТребуетсяОбучение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВесЗначения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДействияСотрудников</name>
    <attributes>
      <name>ДействиеСотрудника</name>
      <type>
        <types>CatalogRef.ДействияСотрудников</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭтапыРаботыСКандидатами</name>
    <attributes>
      <name>ЭтапРаботы</name>
      <type>
        <types>CatalogRef.ЭтапыРаботыСКандидатами</types>
      </type>
    </attributes>
    <attributes>
      <name>ШаблонАнкеты</name>
      <type>
        <types>CatalogRef.ШаблоныАнкет</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

EDT/ZUP/zup_edt/src/Documents/ЗаявкаНаПодборПерсонала/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения = Неопределено Тогда
		ЗаполнитьНовыйОбъект();
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ПрофилиДолжностей") Тогда
		ЗаполнитьПоПрофилюДолжности(ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ЗарплатаКадры.ПроверитьКорректностьДаты(Ссылка, ПланируемаяДатаЗакрытия, "Объект.ПланируемаяДатаЗакрытия", Отказ, НСтр("ru='Дата закрытия'"), , , Ложь);

	ПроверитьЗаполнениеПозиции(Отказ, ПроверяемыеРеквизиты);
	ПроверитьЗаполнениеДолжности(Отказ, ПроверяемыеРеквизиты);
	ПроверитьЗаполнениеПодразделения(Отказ, ПроверяемыеРеквизиты);
	ПроверитьЗаполнениеОписанияЗаявки(Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	// Проверим, нет ли зарегистрированных вакансий с параметрами заявки
	Если СпособНабора = Перечисления.СпособНабораПерсоналаНаВакансию.МассовыйНабор Тогда
		Если Справочники.Вакансии.ЕстьДругиеВакансииПоКомбинацииДолжностьПодразделение(Должность, Подразделение, Ссылка) Тогда
			ВызватьИсключение НСтр("ru = 'Существует вакансия с аналогичными должностью и подразделением.'");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПоПрофилюДолжности(Профиль)
	
	ПрофильДолжности = Профиль;
	
	ПараметрыПолучения = Справочники.ПрофилиДолжностей.ПараметрыПолученияДанныхПрофиляДолжности();
	ПараметрыПолучения.ЭтапыРаботыСКандидатами = Истина;
	
	ДанныеПрофиля = Справочники.ПрофилиДолжностей.ДанныеПрофиляДолжности(Профиль, ПараметрыПолучения);
	
	// Попробуем подобрать позицию штатного расписания, если штатное расписание используется.
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьШтатноеРасписание") Тогда
		// Штатное расписание не используется, заполняем независимо от позиции подразделение и должность.
		Подразделение = ДанныеПрофиля.Подразделение;
	Иначе
		ТекстЗапроса = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ПозицииШтатногоРасписания.Ссылка,
			|	ПозицииШтатногоРасписания.Приоритет
			|ИЗ
			|	(ВЫБРАТЬ
			|		ШтатноеРасписание.Ссылка КАК Ссылка,
			|		1 КАК Приоритет
			|	ИЗ
			|		Справочник.ШтатноеРасписание КАК ШтатноеРасписание
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия КАК МестоПозиции
			|			ПО (МестоПозиции.Позиция = ШтатноеРасписание.Ссылка)
			|				И (МестоПозиции.Подразделение = &Подразделение)
			|				И (ШтатноеРасписание.Должность = &Должность)
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		ШтатноеРасписание.Ссылка,
			|		2
			|	ИЗ
			|		Справочник.ШтатноеРасписание КАК ШтатноеРасписание
			|	ГДЕ
			|		ШтатноеРасписание.Должность = &Должность) КАК ПозицииШтатногоРасписания
			|
			|УПОРЯДОЧИТЬ ПО
			|	ПозицииШтатногоРасписания.Приоритет";

		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("Должность", ДанныеПрофиля.Должность);
		Запрос.УстановитьПараметр("Подразделение", ДанныеПрофиля.Подразделение);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ЗаполнитьПоПозицииШтатногоРасписания(Выборка.Ссылка);
		КонецЕсли;
	КонецЕсли;
	
	Если ДанныеПрофиля.Свойство("ХарактеристикиПерсонала") Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ДанныеПрофиля.ХарактеристикиПерсонала, ХарактеристикиПерсонала);
	КонецЕсли;
	Если ДанныеПрофиля.Свойство("ДействияСотрудников") Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ДанныеПрофиля.ДействияСотрудников, ДействияСотрудников);
	КонецЕсли;
	
	Требования = ДанныеПрофиля.Требования;
	Обязанности = ДанныеПрофиля.Обязанности;
	Условия = ДанныеПрофиля.Условия;
	
КонецПроцедуры

Процедура ЗаполнитьПоПозицииШтатногоРасписания(ПозицияШтатногоРасписания)
	
	Позиция = ПозицияШтатногоРасписания;
	
	ДанныеПозиции = Справочники.ШтатноеРасписание.ДанныеПозицииШтатногоРасписания(ПозицияШтатногоРасписания);
	
	Подразделение = ДанныеПозиции.МестоВСтруктуреПредприятия;
	ПредполагаемыйДоход = ДанныеПозиции.ФОТ;
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеПозиции(Отказ, ПроверяемыеРеквизиты)
	
	Если НазначениеНабора = Перечисления.НазначениеНабораПерсоналаНаВакансию.ДолжностьПодразделение Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "Позиция");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеПодразделения(Отказ, ПроверяемыеРеквизиты)
	
	Если СпособНабора = Перечисления.СпособНабораПерсоналаНаВакансию.МассовыйНабор Или НоваяПозиция Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "Подразделение");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеДолжности(Отказ, ПроверяемыеРеквизиты)
	
	Если НоваяПозиция Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "Должность");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеОписанияЗаявки(Отказ, ПроверяемыеРеквизиты)
	
	Если СоответствуетПрофилюДолжности Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "ПрофильДолжности");
		
	Если ПолучитьФункциональнуюОпцию("ИспользоватьЭлектронноеИнтервью") Тогда
		ПроверяемыеРеквизиты.Добавить("ДействияСотрудников");
	Иначе
		ПроверяемыеРеквизиты.Добавить("Требования");
		ПроверяемыеРеквизиты.Добавить("Обязанности");
		ПроверяемыеРеквизиты.Добавить("Условия");
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьНовыйОбъект() Экспорт
	
	Если Не Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Дата)И Не ЗначениеЗаполнено(ПланируемаяДатаЗакрытия) Тогда
		ДатаОткрытия = ТекущаяДатаСеанса();
		ПланируемаяДатаЗакрытия =
			ПодборПерсонала.ПланируемаяДатаЗакрытияПоУмолчанию(ДатаОткрытия);
	КонецЕсли
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
